# Python для визуализации данных

*Рогович Татьяна, ВШЭ*

## Упражнения

Первые три задания работаем с набором данных, который содержит всех новорожденных и их имена в CША. Последние два задания делаем на уже известном вам датасете про индийских женщин и диабет.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

babies = pd.read_csv('https://raw.githubusercontent.com/pileyan/Data/master/data/babies%20names/babies_all.txt', index_col=0)
pima = pd.read_csv('https://raw.githubusercontent.com/pileyan/Data/master/data/pima-indians-diabetes.csv')

C:\Users\kzolo\anaconda3\lib\site-packages\numpy\lib\arraysetops.py:569: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

In [2]:
babies.tail()

            name sex  number  year
33833    Zymaire   M       5  2010
33834     Zyonne   M       5  2010
33835  Zyquarius   M       5  2010
33836      Zyran   M       5  2010
33837      Zzyzx   M       5  2010

In [3]:
babies

            name sex  number  year
0           Mary   F    7065  1880
1           Anna   F    2604  1880
2           Emma   F    2003  1880
3      Elizabeth   F    1939  1880
4         Minnie   F    1746  1880
...          ...  ..     ...   ...
33833    Zymaire   M       5  2010
33834     Zyonne   M       5  2010
33835  Zyquarius   M       5  2010
33836      Zyran   M       5  2010
33837      Zzyzx   M       5  2010

[1690784 rows x 4 columns]

In [4]:
pd.isnull(babies).sum()

name      0
sex       0
number    0
year      0
dtype: int64

In [5]:
babies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1690784 entries, 0 to 33837
Data columns (total 4 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   name    1690784 non-null  object
 1   sex     1690784 non-null  object
 2   number  1690784 non-null  int64
 3   year    1690784 non-null  int64
dtypes: int64(2), object(2)
memory usage: 64.5+ MB

In [6]:
pima.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Class
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1

## Задание 1.
Исследуйте набор данных babies. Ответьте на вопросы.

1) Какие годы включает датасет

In [7]:
babies['year'].unique()

array([1880, 1881, 1882, 1883, 1884, 1885, 1886, 1887, 1888, 1889, 1890,
       1891, 1892, 1893, 1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901,
       1902, 1903, 1904, 1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912,
       1913, 1914, 1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923,
       1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934,
       1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945,
       1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956,
       1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967,
       1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978,
       1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989,
       1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010],
      dtype=int64)

2) Какое имя в датасете находится по индексом 121?

In [8]:
# доступ по индексу
babies.loc[121]

       name sex  number  year
121     Ann   F     131  1880
121    Anne   F     131  1881
121   Josie   F     169  1882
121    Lola   F     172  1883
121   Hazel   F     209  1884
..      ...  ..     ...   ...
121     Eva   F    2782  2006
121   Naomi   F    2773  2007
121   Bella   F    2772  2008
121   Jenna   F    2619  2009
121  Nicole   F    2535  2010

[131 rows x 4 columns]

In [9]:
# доступ по позиционированию
babies.iloc[121]

name       Ann
sex          F
number     131
year      1880
Name: 121, dtype: object

3) Cколько всего родилось детей по имени 'Aaron' за все время?

In [10]:
babies[(babies['name']=='Aaron')]['number'].sum()

527668

4) Насколько больше за все время родилось мальчиков чем девочек?

In [11]:
babies[(babies['sex']=='M')]['number'].sum()-babies[(babies['sex']=='F')]['number'].sum()

2422447

5) Cколько мальчиков родилось в 2010?

In [12]:
babies[(babies['sex']=='M') & (babies['year']==2010)]['number'].sum()

1898382

6) Сколько в датасете девочек по имени John?

In [13]:
babies[(babies['sex']=='F') & (babies['name']=='John')]['number'].sum()

21578

## Задание 2

1. Сгруппируйте набор данных babies по году и полу и сохраните результаты в два новых датафрейма: babies_girls и babies_boys.
2. Создайте фигуру matplotlib с 3 графиками один под другим.
3. Постройте линейные графики. Первый график должен показывать тренд рождаемости для девочек, второй - для мальчиков, третий объединять их все вместе (с теми же цветами, что в индивидуальных графиках). Годы - x, количество детей - y. 
4. Верхняя и правая границы графиков должны быть невидимы, к каждому графику должен быть заголовок, третий график должен содержать легенду, шкалы графиков должны быть подписаны.
5. Для шкалы количество должны быть установлены лимиты, чтобы она была одинакова на обоих графиках.
6. Кратко опишите тренды в ячейке markdown под графиками.

Если при группировке вы сделали год индексом, то можно обратиться к значениям этой переменной через аттрибут .index

In [14]:
babies.groupby(['year','sex'])['number'].sum()

year  sex
1880  F        90993
      M       110493
1881  F        91955
      M       100748
1882  F       107851
              ...
2008  M      2032310
2009  F      1827643
      M      1973359
2010  F      1759010
      M      1898382
Name: number, Length: 262, dtype: int64

In [15]:
babies_girls=babies[(babies['sex']=='F')].groupby(['year'], as_index=False)['number'].sum()

In [16]:
babies_girls

     year   number
0    1880    90993
1    1881    91955
2    1882   107851
3    1883   112322
4    1884   129021
..    ...      ...
126  2006  1896468
127  2007  1916888
128  2008  1883645
129  2009  1827643
130  2010  1759010

[131 rows x 2 columns]

In [17]:
babies_boys=babies[(babies['sex']=='M')].groupby(['year'], as_index=False)['number'].sum()
babies_boys.columns=['year','number']

In [18]:
babies_boys

     year   number
0    1880   110493
1    1881   100748
2    1882   113687
3    1883   104632
4    1884   114445
..    ...      ...
126  2006  2050234
127  2007  2069242
128  2008  2032310
129  2009  1973359
130  2010  1898382

[131 rows x 2 columns]

## Задание 3

1. Сгруппируйте нужным способом датафрейм babies и найдите 4 самых популярных имени за всю историю (2 женских и 2 мужских).
2. Для каждого найденного имени создайте новый датафрейм вида babies_alisa и сохраните в него данные, сколько детей с таким именем рождалось каждый год.
3. Создайте фигуру matplotlib с 4 горизонтальными графиками один под другим.
4. Постройте 4 линейных графика - тренд для каждого имени за все время.
5. Верхняя и правая границы графиков должны быть невидимы, каждый график должен содержать легенду, один общий заголовок, шкалы графиков должны быть подписаны.
6. Для шкалы количество должны быть установлены лимиты, чтобы она была одинакова на обоих графиках.
7. Опишите тренды в ячейке markdown под графиками.

In [ ]:
# ( ͡° ͜ʖ ͡°)づ ━━ ✫・*。

## Задание 4

1. В оригинальном датафрейме babies создайте новую колонку - первая буква имени.
2. Выберете год из датасета. Сгруппируйте датасет, чтобы в нем в рядах были первые буквы, а в колонках - количество детей с такими именами. Сохраните три новых датафрейма для любых трех лет из выборки с такой группировкой.
3. Создайте фигуру matplotlib с 3 горизонтальными графиками один под другим.
4. Верхняя и правая границы графиков должны быть невидимы, каждый график быть с заголовком, шкалы графиков должны быть подписаны.
5. Постройте столбчатую диаграмму для каждого года. 
6. Сделайте вывод - какие первые буквы имени были самыми популярными в каждом году.

In [ ]:
# ( ͡° ͜ʖ ͡°)づ ━━ ✫・*。

## Задание 4

1. Создайте фигуру matplotlib с двумя осями координат (1 ряд, две колонки)
2. В первой оси координат для датасета pima постройте мультивариативный график рассеяния. Шкала x - уровень глюкозы, шкала y - давление, размер - возраст, цвет - наличие диабета (Class). 
3. Во второй оси координат постройте мультивариативный график, где по x - количество беременностей, y - BMI, цвет - наличие диабета. У этого графика принудительно приведите значения шкалы x к дискретным (с помощью метода оси координат, смотрели такой для леса).
4. Верхняя и правая границы графиков должны быть невидимы, каждый график быть с заголовком, шкалы графиков должны быть подписаны.
5. По графикам вывод как эти переменные могут быть связаны с зависимой переменной (класс).

In [89]:
# ( ͡° ͜ʖ ͡°)づ ━━ ✫・*。

## Дополнительное задание

1. Создайте на основе датасета pima новый датасет: ряды - количество беременностей, колонки: mean_glucose (средний показатель уровня глюкозы для каждого количества беременностей), mean_bmi (аналогично для BMI). 
2. Создайте фигуру matplotlib с одним объектом.
2. Постройте для этого датасета совмещенную столбчатую диаграмму (для каждого значения переменной Pregnancies должно быть две колонки - mean_glucose, mean_bmi.
3. Верхняя и правая границы графика должны быть невидимы, график должен быть с заголовком, шкалы графика должны быть подписаны.
4. Сделайте вывод о связи количества беременностей и средних уровней глюкозы и индекса массы тела.

In [ ]:
# ( ͡° ͜ʖ ͡°)づ ━━ ✫・*。